In [1]:
import sqlite3
import pandas as pd 

DB_PATH = 'escola_v2.db' # Caminho para o banco de dados SQLite

In [2]:
def executar_query(sql_query):
    try:
        conn = sqlite3.connect(DB_PATH)
        df_resultado = pd.read_sql_query(sql_query, conn)
        conn.close()
        return df_resultado
    except:
        print("Erro")

# EXERCÍCIOS

1) Filltrar Alunos que moram em São Paulo
2) Filtrar Alunos que começam com C
3) Filtrar Cursos que custam entre 300 e 500
4) Filtrar Matriculas que estão Ativas ou Concluídas

In [4]:
executar_query('SELECT name FROM sqlite_schema WHERE type="table";')

         name
0      alunos
1      cursos
2  matriculas

In [10]:
query_tabela_alunos = 'SELECT * FROM alunos LIMIT 1'

query_tabela_cursos = 'SELECT * FROM cursos LIMIT 1'

query_tabela_matriculas = 'SELECT * FROM matriculas LIMIT 1'

executar_query(query_tabela_alunos)

   id_aluno       nome          email     cidade data_nascimento
0         1  Ana Silva  ana@email.com  São Paulo      1995-03-10

In [11]:
executar_query(query_tabela_cursos)

   id_curso nome_curso   nivel  preco_mensal
0       101     Inglês  Básico         300.0

In [12]:
executar_query(query_tabela_matriculas)

   id_matricula  id_aluno  id_curso data_matricula status  nota_final
0          1001         1       101     2023-01-15  Ativo         8.5

In [13]:
query_alunos_cidade = 'SELECT nome, cidade FROM alunos WHERE cidade = "São Paulo"'

executar_query(query_alunos_cidade)

         nome     cidade
0   Ana Silva  São Paulo
1  Carla Diaz  São Paulo

In [ ]:
query_alunos_comecam_C = 'SELECT nome FROM alunos WHERE nome LIKE "C%"'

executar_query(query_alunos_comecam_C)

         nome
0  Carla Diaz

In [17]:
query_cursos_valor = 'SELECT * FROM cursos WHERE preco_mensal BETWEEN 300.0 AND 500.0'

executar_query(query_cursos_valor)

   id_curso nome_curso          nivel  preco_mensal
0       101     Inglês         Básico         300.0
1       102     Inglês       Avançado         450.0
2       103   Espanhol  Intermediário         350.0
3       104    Francês         Básico         320.0

In [62]:
query_matriculas_ativas_ou_concluidas = 'SELECT * FROM matriculas WHERE status IN ("Ativo", "Concluido")'

query_matriculas_ativas_ou_concluidas_count = '''
SELECT
    status, 
    count (status) AS qtd 
FROM
    matriculas 
WHERE
    status IN ("Ativo", "Concluido") 
GROUP BY 1
'''

executar_query(query_matriculas_ativas_ou_concluidas_count)

      status  qtd
0      Ativo    4
1  Concluido    1